{
    "id": "chicken-cannellini-bean-pea-salad",
    "name": "Slow-Cooked Chicken with Cannellini Bean Pea Salad",
    "image": "images/recipes/chicken-cannellini-bean-pea-salad.jpg",
    "tags": ["main","chicken","healthy","keto","lactose-free"],
    "author": "Kitty Coles, Mob",
    "edited": true,
    "prepTime": "10m",
    "cookTime": "1h 10m",
    "servings": 4,
    "ingredients": [
        "4 chicken legs",
        "2 lemons",
        "4 tbsp capers",
        "20g fresh thyme",
        "10 garlic cloves",
        "1 tsp paprika",
        "240g (1 can) drained cooked cannellini beans",
        "75ml water",
        "3 tbsp olive oil",
        "200g frozen peas",
        "200g sugar snap peas",
        "20g fresh parsley & mint (can sub any herb)"
    ],
    "method": [
        "Heat the oven to 220°C. Season the chicken legs all over with salt. Peel the skin of 2/3 of the lemons into strips with a peeler. Peel the garlic cloves but leave them whole.",
        "Add the olive oil, capers, thyme, lemon peel, garlic and paprika to a high-sided baking tray that's just big enough to fit the chicken legs in. Give it a mix then add the chicken, turning once so it’s evenly coated in the oil.",
        "Roast the chicken in the oven for 25 mins, then turn the heat down to 170 °C and roast for 30 mins or until the chicken is golden starting to fall away from the bone.",
        "Remove and set aside the chicken and thyme from the tray, leaving the cooking juices behind. Add the drained beans and water to the tray, then add the chicken back on top and roast for a further 15 mins.",
        "Meanwhile, slice the sugar snaps in half lengthways. Cook the peas and sugar snaps in a pot of salted boiling water for 2 minutes until just cooked, then drain and rinse under cold water.",
        "Pick the leaves from the herbs and add to a bowl with the veg then squeeze over the juice of half a lemon then season with salt and pepper.",
        "Spoon the chicken and beans onto a platter before topping with the salad or serving alongside."
    ],
    "nutrition": {
        "columns": ["Per Serving"],
        "calories": [618],
        "carbohydrates": [24],
        "sugar": [6],
        "protein": [44],
        "fat": [33],
        "saturated fat": [7],
        "fibre": [10],
        "salt": [0.27]
    },
    "source": "https://dimsimlim.com/pork-and-holy-basil-stir-fry/",
    "imageSource": "",
    "through": "Alex Persson",
    "datetime": "2024-08-18 12:51:58.591576"
}