{
    "id": "smashed-sichuan-chicken",
    "name": "Smashed Sichuan Chicken",
    "image": "images/recipes/smashed-sichuan-chicken.jpg",
    "tags": ["main","chicken","chinese","high-protein","rapid","cheap-and-cheerful","lactose-free"],
    "author": "Seema Pankhania, Mob",
    "edited": false,
    "prepTime": "20m",
    "cookTime": "15m",
    "servings": 4,
    "ingredients": [
        "4 garlic cloves",
        "15g ginger",
        "1/2 tsp chilli flakes",
        "3 tbsp balsamic vinegar",
        "2 tbsp soy sauce",
        "200g green beans",
        "200g celery",
        "1 cucumber",
        "6 boneless skinless chicken thighs",
        "15g coriander, optional",
        "30g salted roasted peanuts, optional",
        "2 tsp sugar, optional"
    ],
    "method": [
        "Mince the garlic and ginger and place in a small saucepan with the chilli flakes.",
        "Add a glug of vegetable oil and heat over medium heat. Cook until toasted and fragrant.",
        "Remove the saucepan from the heat and whisk in the balsamic vinegar, soy sauce, and sugar. Leave to cool.",
        "Trim the green beans. Boil in salted water until tender-crisp, around 3 mins, then drain.",
        "Meanwhile, thinly slice the celery on a diagonal, peel the cucumber into ribbons, crush the peanuts, and roughly chop the coriander.",
        "Season the chicken thigh fillets with salt and pepper on both sides. Place in a cold non-stick frying pan.",
        "Heat the frying pan over medium heat and cook the chicken undisturbed for 6 mins, or until deep golden brown. Flip and cook for a further 4 mins, or until cooked through, then transfer to a chopping board to rest.",
        "Place the green beans, celery, and cucumber in a mixing bowl. Add half of the dressing and toss to coat. Transfer to a platter.",
        "Chop the chicken and place on top of the salad with the crushed peanuts and chopped coriander. Top with the remaining dressing then tuck in and enjoy!"
    ],
    "nutrition": {
        "columns": ["Per Serving"],
        "calories": [438],
        "carbohydrates": [12],
        "sugar": [8],
        "protein": [45],
        "fat": [21],
        "saturated fat": [4],
        "fibre": [5],
        "salt": [0.52]
    },
    "source": "https://www.mob.co.uk/recipes/smashed-sichaun-chicken",
    "imageSource": "",
    "through": "Alex Persson",
    "datetime": "2024-08-18 22:13:38.407364"
}